# Data Manipulation & Analysis With Pandas

## Introduction

**pandas** is a Python library that provides high-performance, easy-to-use data structures and data analysis tools. In many ways pandas provides a Python equivilent of the data analysis and manipulation tools avialble in the R programming language. Full details of pandas are available at [pandas.pydata.org](http://pandas.pydata.org/)

pandas fits very nicely as part of the iPython Notebook environment along with librarires such as numpy, scikit learn, and matplotlib.

The pandas website describes the highlights of the pandas library as:

* A fast and efficient DataFrame object for data manipulation with integrated indexing;
* Tools for reading and writing data between in-memory data structures and different formats: CSV and text files, Microsoft Excel, SQL databases, and the fast HDF5 format;
* Intelligent data alignment and integrated handling of missing data: gain automatic label-based alignment in computations and easily manipulate messy data into an orderly form;
* Flexible reshaping and pivoting of data sets;
* Intelligent label-based slicing, fancy indexing, and subsetting of large data sets;
* Columns can be inserted and deleted from data structures for size mutability;
* Aggregating or transforming data with a powerful group by engine allowing split-apply-combine operations on data sets;
* High performance merging and joining of data sets;
* Hierarchical axis indexing provides an intuitive way of working with high-dimensional data in a lower-dimensional data structure;
* Time series-functionality: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging. Even create domain-specific time offsets and join time series without losing data;
* Highly optimized for performance, with critical code paths written in Cython or C.
* Python with pandas is in use in a wide variety of academic and commercial domains, including Finance, Neuroscience, Economics, Statistics, Advertising, Web Analytics, and more.

## Pandas Data Structures

To get started we import the **pandas** library (and the **numpy** library as much of pandas is based on this).

In [ ]:
from IPython.display import display, HTML
import pandas as pd
import numpy as np

Pandas offers two key data structures that are optimised for data analysis and manipulation: **Series** and **DataFrame**. the key distinction of these data structures over basic Python data structures is that they make it easy to associate labels with data - for example row and column names.

### Series

In pandas a Series is a one-dimensional array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.).  the difference between this and a basic Python list or tuple is that the elements in the array can have a custom label, or **index** - that is they are not limited to a simple nueric index like the basic Python data structures.

#### Creation

To create a pandas Series we use the **Series** method. The simplest way to create a pandas Series is to pass it a list of values and use a simple numeric index (a not very exictiing way to use a pandas Series!).

In [ ]:
my_series = pd.Series([45, 232, 45, 67, 1, 88, 99, 65])
print(my_series)

We can also explictily pass a list of index values to the Series method so as to use a more intersting index. For example:

In [ ]:
populations = pd.Series([1357000000, 1252000000, 321068000, 249900000, 200400000, 191854000], 
                        ["China", "India", "United States", "Indonesia", "Brazil", "Pakistan"])
print(populations)

This is very similar to a Python dictionary. In fact we can create a pandas series directly from a Python dictionary:

In [ ]:
populations = pd.Series({"China":1357000000, "India":1252000000, "United States":321068000, "Indonesia":249900000, "Brazil":200400000, "Pakistan":191854000})
print(populations)

#### Operations

The pandas Series object, however, supports interesting data analysis functionality. For example, we can perform a range of simple analysis tasks on this Series object:

In [ ]:
populations.min()

In [ ]:
populations.max()

In [ ]:
populations.median()

In [ ]:
populations.mean()

In [ ]:
populations.std()

The **describe** method generates a nice summary set of descriptive statistics:

In [ ]:
populations.describe()

#### Access & Manipulation

A pandas Series offers a number of choices for accessing elements. We can use simple index numbers:

In [ ]:
populations[0]

In [ ]:
populations[5]

We can use slicing through the **:** operator (remenber that **start:end** includes the elements from index start up to but not including index end):

In [ ]:
populations[2:5]

In [ ]:
populations[:5]

In [ ]:
populations[2:]

We can also provide Boolean expressions for conditional data acess. For example, to generate a list of countries with populations greater than 1 billion we use:

In [ ]:
populations[populations > 1000000000]

We can also access elements using the index defined at creation (like we would with a dictionary):

In [ ]:
populations

In [ ]:
populations["Brazil"]

Using the index is also the easiest way to change elements in a pandas Series:

In [ ]:
populations["China"] = 1374730000
print(populations)

Although changes can always also be made using numeric indices:

In [ ]:
populations[2] = 1236344631
print(populations)

### DataFrame

A pandas **DataFrame** is a 2-dimensional labeled data structure with columns of data that can be of different types. The DataFrame is essentially equivilent to a spreadsheet, and SQL table, and R data frame, or a SAS dataset. The DataFrame is the most commonly used pandas object and usually why we use pandas. Rows and columns in a DataFrame can be labelled, which allows for easy data access.

In [1]:
from IPython.display import display, HTML
import pandas as pd
import numpy as np

#### Creation

The easiest way to create a pandas DataFrame is to pass the **DataFrame** method a dictionary of lists (each list will be a **column** in the DataFrame):

In [4]:
countries = pd.DataFrame({"Country":["China", "India", "United States", "Indonesia", "Brazil", "Pakistan"],
                          "Population":[1357000000, 1252000000, 321068000, 249900000, 200400000, 191854000],
                          "GDP":[11384760, 2182580, 17968200, 888648, 1799610, 246849],
                          "Life Expectancy":[75.41, 68.13, 79.68, 72.45, 73.53, 67.39]})
display(countries)

         Country       GDP  Life Expectancy  Population
0          China  11384760            75.41  1357000000
1          India   2182580            68.13  1252000000
2  United States  17968200            79.68   321068000
3      Indonesia    888648            72.45   249900000
4         Brazil   1799610            73.53   200400000
5       Pakistan    246849            67.39   191854000

Data frames can also be created easily using a list of dictionary objects each of which defines data using the same data format:

In [ ]:
countries = pd.DataFrame([{"Country":"China", "Population":1357000000, "GDP":11384760, "Life Expectancy":75.41},
                         {"Country":"India", "Population":1252000000, "GDP":2182580, "Life Expectancy":68.13},
                         {"Country":"United States", "Population":321068000, "GDP":17968200, "Life Expectancy":79.68},
                         {"Country":"Indonesia", "Population":249900000, "GDP":888648, "Life Expectancy":72.45},
                         {"Country":"Brazil", "Population":200400000, "Life Expectancy":73.53},
                         {"Country":"Pakistan", "Population":191854000, "GDP":246849, "Life Expectancy":67.39}])
display(countries)

Note that the DataFrame is able to gracefully handle the missing GDP value for Brazil. This is one of the advantages of a pandas DataFrame.

Another nice thing about pandas is that we can load a DataFrame directly from a .csv file using the **read_csv** method. In this example we read data about a longer list of countries:

In [37]:
extended_countries = pd.read_csv('FMLPDA_Table_5_ex_3.csv')
display(extended_countries)

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
0,Afghanistan,59.61,23.21,74.3,4.44,0.4,1.5171
1,Haiti,45.00,47.67,73.1,0.09,3.4,1.7999
2,Nigeria,51.30,38.23,82.6,1.07,4.1,2.4493
3,Egypt,70.48,26.58,19.6,1.86,5.3,2.8622
4,Argentina,75.77,32.30,13.3,0.76,10.1,2.9961
5,China,74.87,29.98,13.7,1.95,6.4,3.6356
6,Brazil,73.12,42.93,14.5,1.43,7.2,3.7741
7,Israel,81.30,28.80,3.6,6.77,12.5,5.8069
8,U.S.A,78.51,29.85,6.3,4.72,13.7,7.1357
9,Ireland,80.15,27.23,3.5,0.60,11.5,7.5360
10,U.K.,80.09,28.49,4.4,2.59,13.0,7.7751
11,Germany,80.24,22.07,3.5,1.31,12.0,8.0461
12,Canada,80.99,24.79,4.9,1.42,14.2,8.6725
13,Australia,82.09,25.40,4.2,1.86,11.5,8.8442
14,Sweden,81.43,22.18,2.4,1.27,12.8,9.2985
15,New Zealand,80.67,27.81,4.9,1.13,12.3,9.4627

The **head** and **tail** methods can be used to show the first or last few lines of a DataFrame:

In [8]:
extended_countries.head()

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
0,Afghanistan,59.61,23.21,74.3,4.44,0.4,1.5171
1,Haiti,45.00,47.67,73.1,0.09,3.4,1.7999
2,Nigeria,51.30,38.23,82.6,1.07,4.1,2.4493
3,Egypt,70.48,26.58,19.6,1.86,5.3,2.8622
4,Argentina,75.77,32.30,13.3,0.76,10.1,2.9961

In [10]:
extended_countries.tail(8)

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
8,U.S.A,78.51,29.85,6.3,4.72,13.7,7.1357
9,Ireland,80.15,27.23,3.5,0.60,11.5,7.5360
10,U.K.,80.09,28.49,4.4,2.59,13.0,7.7751
11,Germany,80.24,22.07,3.5,1.31,12.0,8.0461
12,Canada,80.99,24.79,4.9,1.42,14.2,8.6725
13,Australia,82.09,25.40,4.2,1.86,11.5,8.8442
14,Sweden,81.43,22.18,2.4,1.27,12.8,9.2985
15,New Zealand,80.67,27.81,4.9,1.13,12.3,9.4627

#### Operations

pandas offers a range of easy to use analysis operations for DataFrames. For example the basic statistics operators return a value for each column in the DataFrame:

In [11]:
extended_countries.mean()

Life Exp.        73.476250
Top-10 Income    29.845000
Infant Mort.     20.550000
Mil. Spend        2.079375
School Years      9.400000
CPI               5.725750
dtype: float64

In [12]:
extended_countries.median()

Life Exp.        79.3000
Top-10 Income    28.1500
Infant Mort.      5.6000
Mil. Spend        1.4250
School Years     11.5000
CPI               6.4713
dtype: float64

In [17]:
extended_countries.max()

Country ID        U.S.A
Life Exp.         82.09
Top-10 Income     47.67
Infant Mort.       82.6
Mil. Spend         6.77
School Years       14.2
CPI              9.4627
dtype: object

In [18]:
extended_countries.describe()

,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
count,16.000000,16.000000,16.000000,16.000000,16.00000,16.000000
mean,73.476250,29.845000,20.550000,2.079375,9.40000,5.725750
std,11.481893,7.295689,28.351296,1.766950,4.28859,2.917551
min,45.000000,22.070000,2.400000,0.090000,0.40000,1.517100
25%,72.460000,25.247500,4.050000,1.115000,6.12500,2.962625
50%,79.300000,28.150000,5.600000,1.425000,11.50000,6.471300
75%,80.750000,30.560000,15.775000,2.110000,12.57500,8.202700
max,82.090000,47.670000,82.600000,6.770000,14.20000,9.462700

#### Filtering Columns

Accessing *columns* in a DataFrame is simply a matter of using the name of the column (similar to dictionary selection) to give a single column Series:

In [19]:
extended_countries["School Years"]

0      0.4
1      3.4
2      4.1
3      5.3
4     10.1
5      6.4
6      7.2
7     12.5
8     13.7
9     11.5
10    13.0
11    12.0
12    14.2
13    11.5
14    12.8
15    12.3
Name: School Years, dtype: float64

In [23]:
extended_countries.columns

Index(['Country ID', 'Life Exp.', 'Top-10 Income', 'Infant Mort.',
       'Mil. Spend', 'School Years', 'CPI'],
      dtype='object')

We can easily select multiple columns by passing a list of column names:

In [26]:
school_details = extended_countries[["Country ID","Life Exp.", "School Years"]]

     Country ID  Life Exp.  School Years
0   Afghanistan      59.61           0.4
1         Haiti      45.00           3.4
2       Nigeria      51.30           4.1
3         Egypt      70.48           5.3
4     Argentina      75.77          10.1
5         China      74.87           6.4
6        Brazil      73.12           7.2
7        Israel      81.30          12.5
8         U.S.A      78.51          13.7
9       Ireland      80.15          11.5
10         U.K.      80.09          13.0
11      Germany      80.24          12.0
12       Canada      80.99          14.2
13    Australia      82.09          11.5
14       Sweden      81.43          12.8
15  New Zealand      80.67          12.3

In [27]:
display(extended_countries)

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years
0,Afghanistan,59.61,23.21,74.3,4.44,0.4
1,Haiti,45.00,47.67,73.1,0.09,3.4
2,Nigeria,51.30,38.23,82.6,1.07,4.1
3,Egypt,70.48,26.58,19.6,1.86,5.3
4,Argentina,75.77,32.30,13.3,0.76,10.1
5,China,74.87,29.98,13.7,1.95,6.4
6,Brazil,73.12,42.93,14.5,1.43,7.2
7,Israel,81.30,28.80,3.6,6.77,12.5
8,U.S.A,78.51,29.85,6.3,4.72,13.7
9,Ireland,80.15,27.23,3.5,0.60,11.5
10,U.K.,80.09,28.49,4.4,2.59,13.0
11,Germany,80.24,22.07,3.5,1.31,12.0
12,Canada,80.99,24.79,4.9,1.42,14.2
13,Australia,82.09,25.40,4.2,1.86,11.5
14,Sweden,81.43,22.18,2.4,1.27,12.8
15,New Zealand,80.67,27.81,4.9,1.13,12.3

We can access rows either using row labels or row indices using the **loc** or **iloc** methods which both return a series (although in our example these will give the same result):

In [ ]:
extended_countries.loc[1]

In [ ]:
extended_countries.iloc[1]

Columns in a DataFrame are easily removed using the **del** operator:

In [25]:
display(extended_countries.head())
del extended_countries["CPI"]
display(extended_countries.head())

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
0,Afghanistan,59.61,23.21,74.3,4.44,0.4,1.5171
1,Haiti,45.00,47.67,73.1,0.09,3.4,1.7999
2,Nigeria,51.30,38.23,82.6,1.07,4.1,2.4493
3,Egypt,70.48,26.58,19.6,1.86,5.3,2.8622
4,Argentina,75.77,32.30,13.3,0.76,10.1,2.9961

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years
0,Afghanistan,59.61,23.21,74.3,4.44,0.4
1,Haiti,45.00,47.67,73.1,0.09,3.4
2,Nigeria,51.30,38.23,82.6,1.07,4.1
3,Egypt,70.48,26.58,19.6,1.86,5.3
4,Argentina,75.77,32.30,13.3,0.76,10.1

#### Filtering Rows

We can also easily slice by rows to get an extract from a DataFrame:

In [28]:
extended_countries[4:9]

  Country ID  Life Exp.  Top-10 Income  Infant Mort.  Mil. Spend  School Years
4  Argentina      75.77          32.30          13.3        0.76          10.1
5      China      74.87          29.98          13.7        1.95           6.4
6     Brazil      73.12          42.93          14.5        1.43           7.2
7     Israel      81.30          28.80           3.6        6.77          12.5
8      U.S.A      78.51          29.85           6.3        4.72          13.7

One very useful way to slice a DataFrame is using a condition. We can pass a list of Bollean values to a DataFrame indicating which rows should be retained (True) and which should be filtered (False). A suitable list is easily generated using a simple Boolean expression on a column from the DataFrame:

In [41]:
mean_CPI = extended_countries["CPI"].mean()
extended_countries[extended_countries["CPI"] < mean_CPI]

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
0,Afghanistan,59.61,23.21,74.3,4.44,0.4,1.5171
1,Haiti,45.00,47.67,73.1,0.09,3.4,1.7999
2,Nigeria,51.30,38.23,82.6,1.07,4.1,2.4493
3,Egypt,70.48,26.58,19.6,1.86,5.3,2.8622
4,Argentina,75.77,32.30,13.3,0.76,10.1,2.9961
5,China,74.87,29.98,13.7,1.95,6.4,3.6356
6,Brazil,73.12,42.93,14.5,1.43,7.2,3.7741

This list can be passed directly to the DataFrame to perform a filtering:

In [ ]:
military_countries = extended_countries[extended_countries["Mil. Spend"] > 2]
display(military_countries)

In [53]:
condition = (extended_countries["School Years"] > 10) & (extended_countries["Mil. Spend"] > 2)
s_and_s = extended_countries[condition]
display(s_and_s)
s_and_s.describe()

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
7,Israel,81.30,28.80,3.6,6.77,12.5,5.8069
8,U.S.A,78.51,29.85,6.3,4.72,13.7,7.1357
10,U.K.,80.09,28.49,4.4,2.59,13.0,7.7751

,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
count,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000
mean,79.966667,29.046667,4.766667,4.693333,13.066667,6.905900
std,1.399083,0.712765,1.386843,2.090128,0.602771,1.004021
min,78.510000,28.490000,3.600000,2.590000,12.500000,5.806900
25%,79.300000,28.645000,4.000000,3.655000,12.750000,6.471300
50%,80.090000,28.800000,4.400000,4.720000,13.000000,7.135700
75%,80.695000,29.325000,5.350000,5.745000,13.350000,7.455400
max,81.300000,29.850000,6.300000,6.770000,13.700000,7.775100

We can also delete rows using the **drop** function.

In [50]:
display(extended_countries)

,Country ID,Life Exp.,Top-10 Income,Infant Mort.,Mil. Spend,School Years,CPI
0,Afghanistan,59.61,23.21,74.3,4.44,0.4,1.5171
1,Haiti,45.00,47.67,73.1,0.09,3.4,1.7999
2,Nigeria,51.30,38.23,82.6,1.07,4.1,2.4493
3,Egypt,70.48,26.58,19.6,1.86,5.3,2.8622
4,Argentina,75.77,32.30,13.3,0.76,10.1,2.9961
5,China,74.87,29.98,13.7,1.95,6.4,3.6356
6,Brazil,73.12,42.93,14.5,1.43,7.2,3.7741
7,Israel,81.30,28.80,3.6,6.77,12.5,5.8069
8,U.S.A,78.51,29.85,6.3,4.72,13.7,7.1357
9,Ireland,80.15,27.23,3.5,0.60,11.5,7.5360
10,U.K.,80.09,28.49,4.4,2.59,13.0,7.7751
11,Germany,80.24,22.07,3.5,1.31,12.0,8.0461
12,Canada,80.99,24.79,4.9,1.42,14.2,8.6725
13,Australia,82.09,25.40,4.2,1.86,11.5,8.8442
14,Sweden,81.43,22.18,2.4,1.27,12.8,9.2985
15,New Zealand,80.67,27.81,4.9,1.13,12.3,9.4627

In [ ]:
extended_countries = extended_countries.drop(extended_countries.index[[6, 12]])
display(extended_countries)

#### Filtering Columns & Rows

We can combine row selection and column selection using the **loc** method. We pass it the row slice first, followed by a list of column headings. For example:

In [ ]:
extended_countries.loc[1:5, ["Country ID", "Top-10 Income"]]

We can do the same thing using numeric indices for columns and rows rather than labels using the **iloc** method:

In [ ]:
extended_countries.iloc[1:5, 2:4]

#### Deriving New Fields

We can easily add new columns to a DataFrame by simply referring to the new column name in an expression. For example:

In [ ]:
display(extended_countries)

In [ ]:
extended_countries["High Education"] = True
extended_countries.head()

Or more interestingly using other columns in the DataFrame:

In [ ]:
extended_countries["High Education"] \
    = extended_countries["School Years"] > 10
extended_countries.head()

In [ ]:
extended_countries["Mil School Ratio"] = \
    extended_countries["Mil. Spend"] / extended_countries["School Years"]
extended_countries.head()

Adding new rows to a DataFrame is easy using the **append** method. For example to append the first 5 rows of the DataFrame again at the end:

In [ ]:
extra_rows = extended_countries[0:6]
extended_countries.append(extra_rows, ignore_index=True) # ignore_index tells pandas not to repat row indices

The **describe** method gives a nice set of summary descriptive statistics for each column:

In [ ]:
extended_countries.describe()

#### Merging DataFrames

We can also *merge* together DataFrames in SQL style join operations using the **merge** method. For example

In [ ]:
country_populations = pd.read_csv('FMLPDA_Table_5_ex_3a.csv')

In [ ]:
display(country_populations)

In [ ]:
display(extended_countries)

In [ ]:
extended_countries_with_pop = \
    pd.merge(extended_countries, country_populations, 
             on="Country ID")
display(extended_countries_with_pop)

In [ ]:
extended_countries_with_pop.shape

The **how** parameter to the merge method determines the type of join that is performed - the options are 'left', 'right', 'outer', 'inner' (the default is 'inner')

In [ ]:
extended_countries_with_pop = \
pd.merge(extended_countries, country_populations, 
         on="Country ID", how = 'outer')
display(extended_countries_with_pop)

In [ ]:
print(extended_countries.shape)
print(country_populations.shape)
print(extended_countries_with_pop.shape)

In [ ]:
extended_countries_with_pop = pd.merge(extended_countries, country_populations, on="Country ID", how = 'left')
display(extended_countries_with_pop)

In [ ]:
extended_countries_with_pop = pd.merge(extended_countries, country_populations, on="Country ID", how = 'right')
display(extended_countries_with_pop)

#### Aggregating DataFrames

If there are a categoricial variables in a dataset we can use them to define groups. Once groups are defined it is possible to perform analysis based on these groups.

Read in a dataset that contains the continet to which each country belongs and add that to the country details dataset.

In [ ]:
country_continents = pd.read_csv('FMLPDA_Table_5_ex_3b.csv')
display(country_continents.head())

In [ ]:
display(extended_countries.head())

In [ ]:
extended_countries_with_contnts = pd.merge(extended_countries, country_continents, on="Country ID", how = 'inner')
display(extended_countries_with_contnts)

To define groups within a dataframe we use the **groupby** function, passing it the name of the column we would like to group by. Using the grouped data then we can then perform grouped analysis.

In [ ]:
extended_countries_with_contnts.groupby('Continent').sum()

We can save the grouping object if we want to perform multiple analyses.

In [ ]:
grouped_data = extended_countries_with_contnts\
                            .groupby('Continent')
display(grouped_data.mean())

In [ ]:
display(grouped_data.max())
display(grouped_data.min())

We can use column selection on the grouped data object to only see details of certain columns.

In [ ]:
display(grouped_data['Life Exp.'].describe())

Or to look at multiple columns:

In [ ]:
display(grouped_data[['Life Exp.', 'Infant Mort.']].describe())

Using groups we can also perform **data aggregation** jobs - rolling up muptiple rows of data into a single row that aggregates them. To do this we use the **agg** function in conection with grouped data. For example to create a dataset containing the mean life expectancy of each continent we could use:

In [ ]:
grouped_data['Life Exp.'].agg([np.mean])

We can add multiple measurs to this aggregation - for example including max and min as well as mean:

In [ ]:
grouped_data['Life Exp.'].agg([np.mean, np.min, np.max])

We can do this for multiple columns from the original dataset to be even more expressive.

In [ ]:
grouped_data[['Life Exp.', 'Infant Mort.']].agg([np.mean, np.min, np.max])

In [ ]:
grouped_data.agg([np.mean])

### Simple Analysis

Remember we can use simple analysis functions to start analysing data. The most interesting are **describe**, and **value_counts**.

In [ ]:
extended_countries_with_pop["School Years"].describe()

In [ ]:
extended_countries_with_contnts["Continent"].describe()

In [ ]:
extended_countries_with_contnts["Continent"].value_counts()

## An Example

In [ ]:
motorInsurance = pd.read_csv('MotorInsuranceFraudClaimABTFull.csv')
display(motorInsurance)

In [ ]:
motorInsurance["Marital Status"].value_counts()